app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY #{User.sort_by_social_connection_index} DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (lower(name) LIKE '%e%')
SELECT  "users".* FROM "users" ORDER BY "users"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @users = User.sort_by_social_connection_index.paginate(:page => params[:page], :per_page => 5)

    if params[:filter]
      @users = User.sorted_by(params[:filter]).paginate(:page => params[:page], :per_page => 5)
    end

    if params[:search]
      @users = User.search(params[:search]).order("name ASC").paginate(:page => params[:page], :per_page => 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "linkedin_connections" = $1, "twitter_followers" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["linkedin_connections", 0], ["twitter_followers", 0], ["updated_at", "2017-10-04 21:05:40.835118"], ["id", 7]]
---
  def update

    @user = User.find(params[:id])
    if @user.update(params[:user].permit(:name, :linkedin_connections, :facebook_friends, :twitter_followers))